chvvkumar/ESP32-P4-NINA-Display/components/esp32_p4_wifi6_touch_lcd/esp32_p4_wifi6_touch_lcd.c
    if (i2s_tx_chan != NULL) {
        ESP_GOTO_ON_ERROR(i2s_channel_init_std_mode(i2s_tx_chan, p_i2s_cfg), err, TAG, "I2S channel initialization failed");
        ESP_GOTO_ON_ERROR(i2s_channel_enable(i2s_tx_chan), err, TAG, "I2S enabling failed");
    }
    if (i2s_rx_chan != NULL) {
        ESP_GOTO_ON_ERROR(i2s_channel_init_std_mode(i2s_rx_chan, p_i2s_cfg), err, TAG, "I2S channel initialization failed");
        ESP_GOTO_ON_ERROR(i2s_channel_enable(i2s_rx_chan), err, TAG, "I2S enabling failed");
    }

    audio_codec_i2s_cfg_t i2s_cfg = {
        .port = CONFIG_BSP_I2S_NUM,
        .rx_handle = i2s_rx_chan,
        .tx_handle = i2s_tx_chan,
    };
    i2s_data_if = audio_codec_new_i2s_data(&i2s_cfg);
    BSP_NULL_CHECK_GOTO(i2s_data_if, err);

    return ESP_OK;

err:
    if (i2s_tx_chan) {
        i2s_del_channel(i2s_tx_chan);
    }
    if (i2s_rx_chan) {
        i2s_del_channel(i2s_rx_chan);
    }

    return ret;
}

esp_codec_dev_handle_t bsp_audio_codec_speaker_init(void)
{
    if (i2s_data_if == NULL) {
        /* Initilize I2C */
        BSP_ERROR_CHECK_RETURN_NULL(bsp_i2c_init());
        /* Configure I2S peripheral and Power Amplifier */
        BSP_ERROR_CHECK_RETURN_NULL(bsp_audio_init(NULL));
    }
    assert(i2s_data_if);

    const audio_codec_gpio_if_t *gpio_if = audio_codec_new_gpio();

    audio_codec_i2c_cfg_t i2c_cfg = {
        .port = BSP_I2C_NUM,
        .addr = ES8311_CODEC_DEFAULT_ADDR,
        .bus_handle = i2c_handle,
    };
    const audio_codec_ctrl_if_t *i2c_ctrl_if = audio_codec_new_i2c_ctrl(&i2c_cfg);
    BSP_NULL_CHECK(i2c_ctrl_if, NULL);

    esp_codec_dev_hw_gain_t gain = {
        .pa_voltage = 5.0,
        .codec_dac_voltage = 3.3,
    };

    es8311_codec_cfg_t es8311_cfg = {
        .ctrl_if = i2c_ctrl_if,
        .gpio_if = gpio_if,
        .codec_mode = ESP_CODEC_DEV_WORK_MODE_DAC,
        .pa_pin = BSP_POWER_AMP_IO,
        .pa_reverted = false,
        .master_mode = false,
        .use_mclk = true,
        .digital_mic = false,
        .invert_mclk = false,
        .invert_sclk = false,
        .hw_gain = gain,
    };
    const audio_codec_if_t *es8311_dev = es8311_codec_new(&es8311_cfg);
    BSP_NULL_CHECK(es8311_dev, NULL);

    esp_codec_dev_cfg_t codec_dev_cfg = {
        .dev_type = ESP_CODEC_DEV_TYPE_OUT,
        .codec_if = es8311_dev,
        .data_if = i2s_data_if,
    };
    return esp_codec_dev_new(&codec_dev_cfg);
}

esp_codec_dev_handle_t bsp_audio_codec_microphone_init(void)
{
    if (i2s_data_if == NULL) {
        /* Initilize I2C */
        BSP_ERROR_CHECK_RETURN_NULL(bsp_i2c_init());
        /* Configure I2S peripheral and Power Amplifier */
        BSP_ERROR_CHECK_RETURN_NULL(bsp_audio_init(NULL));
    }
    assert(i2s_data_if);

    audio_codec_i2c_cfg_t i2c_cfg = {
        .port = BSP_I2C_NUM,
        .addr = BSP_ES7210_CODEC_ADDR,
        .bus_handle = i2c_handle,
    };
    const audio_codec_ctrl_if_t *i2c_ctrl_if = audio_codec_new_i2c_ctrl(&i2c_cfg);
    BSP_NULL_CHECK(i2c_ctrl_if, NULL);

    es7210_codec_cfg_t es7210_cfg = {
        .ctrl_if = i2c_ctrl_if,
    };
    const audio_codec_if_t *es7210_dev = es7210_codec_new(&es7210_cfg);
    BSP_NULL_CHECK(es7210_dev, NULL);

    esp_codec_dev_cfg_t codec_es7210_dev_cfg = {
        .dev_type = ESP_CODEC_DEV_TYPE_IN,
        .codec_if = es7210_dev,
        .data_if = i2s_data_if,
    };
    return esp_codec_dev_new(&codec_es7210_dev_cfg);
}

// Bit number used to represent command and parameter
#define LCD_LEDC_CH            CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH

esp_err_t bsp_display_brightness_init(void)
{
    const ledc_channel_config_t LCD_backlight_channel = {
        .gpio_num = BSP_LCD_BACKLIGHT,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel = LCD_LEDC_CH,
        .intr_type = LEDC_INTR_DISABLE,
        .timer_sel = 1,
        .duty = 0,
        .hpoint = 0,
        .flags = { .output_invert = 1 }
    };
    const ledc_timer_config_t LCD_backlight_timer = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .duty_resolution = LEDC_TIMER_10_BIT,
        .timer_num = 1,
        .freq_hz = 5000,
        .clk_cfg = LEDC_AUTO_CLK
    };

    BSP_ERROR_CHECK_RETURN_ERR(ledc_timer_config(&LCD_backlight_timer));
    BSP_ERROR_CHECK_RETURN_ERR(ledc_channel_config(&LCD_backlight_channel));

    return ESP_OK;
}

/* Panel table
 *
 * Every GPIO, the DSI PHY LDO channel and voltage, the lane count, the LEDC
 * timer/channel/frequency/polarity and the DBI command widths are identical on
 * all three boards and stay constants above. Only what actually differs is a
 * row here.
 *
 * The two round rows instantiate ONE init macro with the page-1 register 0x40
 * byte as its parameter, so each row owns an immutable table. The square row
 * passes init_cmds = NULL and the ST7703 driver runs its own default sequence,
 * which is exactly what this BSP did before the table existed. */

typedef esp_err_t (*bsp_panel_new_fn)(const esp_lcd_panel_io_handle_t io,
                                      const esp_lcd_panel_dev_config_t *dev_cfg,
                                      esp_lcd_panel_handle_t *ret_panel);

typedef struct {
    const char        *name;
    bsp_panel_new_fn   panel_new;
    const void        *init_cmds;      /* jd9365_lcd_init_cmd_t[], NULL for ST7703 */
    uint16_t           init_cmds_size;
    uint16_t           h_res;
    uint16_t           v_res;
    uint32_t           lane_rate_mbps;
    uint32_t           dpi_clock_mhz;
    uint16_t           hbp, hpw, hfp;
    uint16_t           vbp, vpw, vfp;
    uint8_t            bright_floor_pct;  /* first point of the brightness curve */
    /* Base orientation, applied ONCE at init as hardware MADCTL state through
     * lvgl_port_display_cfg_t.rotation. Never an LVGL rotation and never a
     * post-start bsp_display_rotate(). 1 means 180 degrees, which both round
     * panels need. The square row stays 0: the ST7703 driver implements
     * mirror_y but neither mirror_x nor swap_xy, so a non-zero base
     * orientation on that panel would silently do the wrong thing.
     * With LVGL rotation pinned at 0 the digitiser must carry the same
     * transform itself, so this one field drives both. */
    uint8_t            base_rot_180;
} bsp_panel_row_t;

/* JD9365 init sequence. The shared entries live in jd9365_init_table.h, which
 * is included ONCE PER ROW with the table name and the page-1 register 0x40
 * byte defined by the includer, so each row owns an immutable table and the
 * shared entries exist in one place. */
#define JD9365_TABLE_NAME s_jd9365_init_3_4
#define JD9365_REG40      0x00
#include "jd9365_init_table.h"

#define JD9365_TABLE_NAME s_jd9365_init_4c
#define JD9365_REG40      0x04
#include "jd9365_init_table.h"

static const bsp_panel_row_t s_panel_rows[] = {
    [BSP_PANEL_SQUARE_4B] = {
        .name = "4B 720x720 ST7703", .panel_new = esp_lcd_new_panel_st7703,
        .init_cmds = NULL, .init_cmds_size = 0,
        .h_res = 720, .v_res = 720,
        .lane_rate_mbps = 480, .dpi_clock_mhz = 38,
        .hbp = 50, .hpw = 20, .hfp = 50,
        .vbp = 20, .vpw = 4,  .vfp = 20,
        .bright_floor_pct = 47,
        .base_rot_180 = 0,
    },
    [BSP_PANEL_ROUND_3_4] = {
        .name = "3.4C 800x800 JD9365", .panel_new = esp_lcd_new_panel_jd9365,
        .init_cmds = s_jd9365_init_3_4,
        .init_cmds_size = sizeof(s_jd9365_init_3_4) / sizeof(s_jd9365_init_3_4[0]),
        .h_res = 800, .v_res = 800,
        .lane_rate_mbps = 1500, .dpi_clock_mhz = 80,
        .hbp = 20, .hpw = 20, .hfp = 40,
        .vbp = 12, .vpw = 4,  .vfp = 24,
        .bright_floor_pct = 0,
        .base_rot_180 = 1,
    },
    [BSP_PANEL_ROUND_4C] = {
        .name = "4C 720x720 JD9365", .panel_new = esp_lcd_new_panel_jd9365,
        .init_cmds = s_jd9365_init_4c,
        .init_cmds_size = sizeof(s_jd9365_init_4c) / sizeof(s_jd9365_init_4c[0]),
        .h_res = 720, .v_res = 720,
        .lane_rate_mbps = 1500, .dpi_clock_mhz = 80,
        .hbp = 20, .hpw = 20, .hfp = 40,
        .vbp = 12, .vpw = 4,  .vfp = 24,
        .bright_floor_pct = 0,
        .base_rot_180 = 1,
    },
};

