chvvkumar/ESP32-P4-NINA-Display/components/esp32_p4_wifi6_touch_lcd/esp32_p4_wifi6_touch_lcd.c
#define BSP_PANEL_ROW_COUNT (sizeof(s_panel_rows) / sizeof(s_panel_rows[0]))

#if CONFIG_NINA_FAMILY_ROUND
static int s_panel_type = BSP_PANEL_ROUND_3_4;
#else
static int s_panel_type = BSP_PANEL_SQUARE_4B;
#endif

static const bsp_panel_row_t *bsp_panel_row(void)
{
    return &s_panel_rows[s_panel_type];
}

esp_err_t bsp_display_set_panel_type(int panel_type)
{
    if (panel_type < 0 || panel_type >= (int)BSP_PANEL_ROW_COUNT) {
        ESP_LOGW(TAG, "unknown panel type %d, keeping %s", panel_type, bsp_panel_row()->name);
        return ESP_ERR_INVALID_ARG;
    }
    s_panel_type = panel_type;
    ESP_LOGI(TAG, "panel row selected: %s", bsp_panel_row()->name);
    return ESP_OK;
}

int bsp_display_get_h_res(void) { return bsp_panel_row()->h_res; }
int bsp_display_get_v_res(void) { return bsp_panel_row()->v_res; }

esp_err_t bsp_display_brightness_set(int brightness_percent)
{
    if (brightness_percent > 100) {
        brightness_percent = 100;
    } else if (brightness_percent < 0) {
        brightness_percent = 0;
    }

    /* Curve and duty both live in bsp/brightness_curve.h, which the host test
     * pins against the square panel's historical numbers. */
    const int floor_pct = bsp_panel_row()->bright_floor_pct;

    ESP_LOGI(TAG, "Setting LCD backlight: %d%%", brightness_percent);

    uint32_t duty_cycle = (uint32_t)bsp_brightness_duty(floor_pct, brightness_percent);
    BSP_ERROR_CHECK_RETURN_ERR(ledc_set_duty(LEDC_LOW_SPEED_MODE, LCD_LEDC_CH, duty_cycle));
    BSP_ERROR_CHECK_RETURN_ERR(ledc_update_duty(LEDC_LOW_SPEED_MODE, LCD_LEDC_CH));

    return ESP_OK;
}

esp_err_t bsp_display_backlight_off(void)
{
    return bsp_display_brightness_set(0);
}

esp_err_t bsp_display_backlight_on(void)
{
    return bsp_display_brightness_set(100);
}

static esp_err_t bsp_enable_dsi_phy_power(void)
{
#if BSP_MIPI_DSI_PHY_PWR_LDO_CHAN > 0
    // Turn on the power for MIPI DSI PHY, so it can go from "No Power" state to "Shutdown" state
    static esp_ldo_channel_handle_t phy_pwr_chan = NULL;
    esp_ldo_channel_config_t ldo_cfg = {
        .chan_id = BSP_MIPI_DSI_PHY_PWR_LDO_CHAN,
        .voltage_mv = BSP_MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV,
    };
    ESP_RETURN_ON_ERROR(esp_ldo_acquire_channel(&ldo_cfg, &phy_pwr_chan), TAG, "Acquire LDO channel for DPHY failed");
    ESP_LOGI(TAG, "MIPI DSI PHY Powered on");
#endif // BSP_MIPI_DSI_PHY_PWR_LDO_CHAN > 0

    return ESP_OK;
}

esp_err_t bsp_display_new(const bsp_display_config_t *config, esp_lcd_panel_handle_t *ret_panel, esp_lcd_panel_io_handle_t *ret_io)
{
    esp_err_t ret = ESP_OK;
    bsp_lcd_handles_t handles;
    ret = bsp_display_new_with_handles(config, &handles);

    *ret_panel = handles.panel;
    *ret_io = handles.io;

    return ret;
}

/* DCS Read Display ID. Both vendor drivers issue this same read during their
 * own init, so it is a known working transaction on both controllers. */
#define BSP_DCS_RDDID              0x04
#define BSP_DSI_PROBE_LANE_MBPS    480

esp_err_t bsp_display_probe_rddid(uint8_t out[3])
{
    if (!out) {
        return ESP_ERR_INVALID_ARG;
    }

    /* Configure the reset pin before pulsing it: the panel constructor does its
     * own reset later through reset_gpio_num, but nothing has configured this
     * pin yet at probe time. */
    const gpio_config_t rst_cfg = {
        .pin_bit_mask = 1ULL << BSP_LCD_RST,
        .mode         = GPIO_MODE_OUTPUT,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    ESP_RETURN_ON_ERROR(gpio_config(&rst_cfg), TAG, "probe: reset pin config failed");
    gpio_set_level(BSP_LCD_RST, 0);
    vTaskDelay(pdMS_TO_TICKS(20));
    gpio_set_level(BSP_LCD_RST, 1);
    vTaskDelay(pdMS_TO_TICKS(120));

    ESP_RETURN_ON_ERROR(bsp_enable_dsi_phy_power(), TAG, "probe: DSI PHY power failed");

    esp_lcd_dsi_bus_config_t bus_config = {
        .bus_id = 0,
        .num_data_lanes = BSP_LCD_MIPI_DSI_LANE_NUM,
        .phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT,
        .lane_bit_rate_mbps = BSP_DSI_PROBE_LANE_MBPS,
    };
    esp_lcd_dsi_bus_handle_t bus = NULL;
    ESP_RETURN_ON_ERROR(esp_lcd_new_dsi_bus(&bus_config, &bus), TAG, "probe: new DSI bus failed");

    esp_lcd_dbi_io_config_t dbi_config = {
        .virtual_channel = 0,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
    };
    esp_lcd_panel_io_handle_t io = NULL;
    esp_err_t err = esp_lcd_new_panel_io_dbi(bus, &dbi_config, &io);
    if (err != ESP_OK) {
        esp_lcd_del_dsi_bus(bus);
        ESP_RETURN_ON_ERROR(err, TAG, "probe: new DBI panel IO failed");
    }

    uint8_t id[3] = {0, 0, 0};
    err = esp_lcd_panel_io_rx_param(io, BSP_DCS_RDDID, id, sizeof(id));

    esp_lcd_panel_io_del(io);
    esp_lcd_del_dsi_bus(bus);

    if (err != ESP_OK) {
        ESP_LOGE(TAG, "RDDID read failed: %s", esp_err_to_name(err));
        return err;
    }
    memcpy(out, id, sizeof(id));
    return ESP_OK;
}

esp_err_t bsp_display_new_with_handles(const bsp_display_config_t *config, bsp_lcd_handles_t *ret_handles)
{
    const bsp_panel_row_t *row = bsp_panel_row();
    esp_err_t ret = ESP_OK;

    ESP_RETURN_ON_ERROR(bsp_display_brightness_init(), TAG, "Brightness init failed");
    ESP_RETURN_ON_ERROR(bsp_enable_dsi_phy_power(), TAG, "DSI PHY power failed");
    ESP_RETURN_ON_ERROR(bsp_enable_ldo_vo4(), TAG, "DSI PHY power failed");

    /* create MIPI DSI bus first, it will initialize the DSI PHY as well */
    esp_lcd_dsi_bus_handle_t mipi_dsi_bus;
    esp_lcd_dsi_bus_config_t bus_config = {
        .bus_id = 0,
        .num_data_lanes = BSP_LCD_MIPI_DSI_LANE_NUM,
        .phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT,
        .lane_bit_rate_mbps = row->lane_rate_mbps,
    };
    ESP_RETURN_ON_ERROR(esp_lcd_new_dsi_bus(&bus_config, &mipi_dsi_bus), TAG, "New DSI bus init failed");

    ESP_LOGI(TAG, "Install MIPI DSI LCD control panel");
    // we use DBI interface to send LCD commands and parameters
    esp_lcd_panel_io_handle_t io;
    esp_lcd_dbi_io_config_t dbi_config = {
        .virtual_channel = 0,
        .lcd_cmd_bits = 8,   // according to the LCD ILI9881C spec
        .lcd_param_bits = 8, // according to the LCD ILI9881C spec
    };
    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_io_dbi(mipi_dsi_bus, &dbi_config, &io), err, TAG, "New panel IO failed");

