chvvkumar/ESP32-P4-NINA-Display/components/esp32_p4_wifi6_touch_lcd/esp32_p4_wifi6_touch_lcd.c
    esp_lcd_panel_handle_t disp_panel = NULL;
    ESP_LOGI(TAG, "Install MIPI DSI panel: %s", row->name);

    esp_lcd_dpi_panel_config_t dpi_config = {
        .dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT,
        .dpi_clock_freq_mhz = row->dpi_clock_mhz,
        .virtual_channel = 0,
#if CONFIG_BSP_LCD_COLOR_FORMAT_RGB888
        .pixel_format = LCD_COLOR_PIXEL_FORMAT_RGB888,
#else
        .pixel_format = LCD_COLOR_PIXEL_FORMAT_RGB565,
#endif
        .num_fbs = CONFIG_BSP_LCD_DPI_BUFFER_NUMS,
        .video_timing = {
            .h_size = row->h_res,
            .v_size = row->v_res,
            .hsync_back_porch  = row->hbp,
            .hsync_pulse_width = row->hpw,
            .hsync_front_porch = row->hfp,
            .vsync_back_porch  = row->vbp,
            .vsync_pulse_width = row->vpw,
            .vsync_front_porch = row->vfp,
        },
        .flags.use_dma2d = true,
    };

    /* lane_num is forwarded ONLY to the JD9365 constructor: the ST7703 vendor
     * config has no such field. */
    st7703_vendor_config_t st7703_cfg = {
        .flags = { .use_mipi_interface = 1 },
        .mipi_config = { .dsi_bus = mipi_dsi_bus, .dpi_config = &dpi_config },
    };
    jd9365_vendor_config_t jd9365_cfg = {
        .init_cmds = (const jd9365_lcd_init_cmd_t *)row->init_cmds,
        .init_cmds_size = row->init_cmds_size,
        .mipi_config = { .dsi_bus = mipi_dsi_bus, .dpi_config = &dpi_config,
                         .lane_num = BSP_LCD_MIPI_DSI_LANE_NUM },
    };

    esp_lcd_panel_dev_config_t lcd_dev_config = {
#if CONFIG_BSP_LCD_COLOR_FORMAT_RGB888
        .bits_per_pixel = 24,
#else
        .bits_per_pixel = 16,
#endif
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .reset_gpio_num = BSP_LCD_RST,
        .vendor_config = (row->panel_new == esp_lcd_new_panel_st7703)
                             ? (void *)&st7703_cfg : (void *)&jd9365_cfg,
    };
    ESP_GOTO_ON_ERROR(row->panel_new(io, &lcd_dev_config, &disp_panel), err, TAG,
                      "New LCD panel failed");
    ESP_GOTO_ON_ERROR(esp_lcd_panel_reset(disp_panel), err, TAG, "LCD panel reset failed");
    ESP_GOTO_ON_ERROR(esp_lcd_panel_init(disp_panel), err, TAG, "LCD panel init failed");

    /* Return all handles */
    ret_handles->io = io;
    ret_handles->mipi_dsi_bus = mipi_dsi_bus;
    ret_handles->panel = disp_panel;
    ret_handles->control = NULL;

    ESP_LOGI(TAG, "Display initialized");

    return ret;

err:
    if (disp_panel) {
        esp_lcd_panel_del(disp_panel);
    }
    if (io) {
        esp_lcd_panel_io_del(io);
    }
    if (mipi_dsi_bus) {
        esp_lcd_del_dsi_bus(mipi_dsi_bus);
    }
    return ret;
}

esp_err_t bsp_touch_new(const bsp_touch_config_t *config, esp_lcd_touch_handle_t *ret_touch)
{
    /* Initilize I2C */
    BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_init());

    /* Initialize touch */
    const bsp_panel_row_t *row = bsp_panel_row();

    /* x_max/y_max must be the LIVE panel resolution: esp_lcd_touch computes
     * x = x_max - x for mirror_x, so a stale 720 on an 800 px panel lands every
     * mirrored touch 80 px off.
     *
     * The transform carries the base orientation. With MADCTL 180 as hardware
     * state and LVGL rotation pinned at 0, the port compensates nothing, so an
     * uncompensated digitiser puts every touch on a round board at the
     * antipode. That is a first-boot symptom which reads as a broken panel. */
    const esp_lcd_touch_config_t tp_cfg = {
        .x_max = bsp_display_get_h_res(),
        .y_max = bsp_display_get_v_res(),
        .rst_gpio_num = BSP_LCD_TOUCH_RST,
        .int_gpio_num = BSP_LCD_TOUCH_INT,
        .levels = {
            .reset = 0,
            .interrupt = 0,
        },
        .flags = {
            .swap_xy  = 0,
            .mirror_x = (row->base_rot_180 != 0),
            .mirror_y = (row->base_rot_180 != 0),
        },
    };

    /* The retry ladder below toggles BSP_LCD_TOUCH_RST directly. Nothing else
     * in this component configures that pin as an output, so without this every
     * "hard reset" in rounds 2 to 5 was a no-op and the ladder burned 3.5 s for
     * nothing. */
    const gpio_config_t rst_cfg = {
        .pin_bit_mask = 1ULL << BSP_LCD_TOUCH_RST,
        .mode         = GPIO_MODE_OUTPUT,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    if (gpio_config(&rst_cfg) != ESP_OK) {
        ESP_LOGW(TAG, "touch reset pin config failed; the retry ladder cannot reset GT911");
    } else {
        /* Drive it HIGH straight away. gpio_config() on an output leaves the
         * output register at its 0 default, which would hold GT911 in reset
         * from here until the driver's own reset pulse; the board previously
         * idled this pin high through its pull-up. Matching that keeps the
         * square board's pre-init state exactly as it was. */
        gpio_set_level(BSP_LCD_TOUCH_RST, 1);
    }

    /*
     * GT911 I2C address depends on the INT pin state during reset:
     *   INT LOW  → 0x5D (primary)
     *   INT HIGH → 0x14 (backup)
     * When INT is not connected (GPIO_NUM_NC), the pin floats and the
     * address is unpredictable per board.  Try both addresses.
     *
     * Some boards also need extra time after cold power-on before the
     * GT911's I2C interface is ready.  Retry with increasing delays.
     */
    const uint16_t gt911_addrs[] = {
        ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS,
        ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS_BACKUP,
    };
    const int num_addrs = sizeof(gt911_addrs) / sizeof(gt911_addrs[0]);
    const int max_rounds = 5;

    esp_err_t ret = ESP_FAIL;
    for (int round = 0; round < max_rounds; round++) {
        for (int addr_idx = 0; addr_idx < num_addrs; addr_idx++) {
            esp_lcd_panel_io_handle_t tp_io_handle = NULL;
            esp_lcd_panel_io_i2c_config_t tp_io_config = ESP_LCD_TOUCH_IO_I2C_GT911_CONFIG();
            tp_io_config.dev_addr = gt911_addrs[addr_idx];
            tp_io_config.scl_speed_hz = CONFIG_BSP_I2C_CLK_SPEED_HZ;
            ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c(i2c_handle, &tp_io_config, &tp_io_handle), TAG, "");

            ret = esp_lcd_touch_new_i2c_gt911(tp_io_handle, &tp_cfg, ret_touch);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "GT911 touch initialized at I2C addr 0x%02X (round %d)", gt911_addrs[addr_idx], round + 1);
                return ESP_OK;
            }

            ESP_LOGW(TAG, "GT911 not found at 0x%02X (round %d/%d)", gt911_addrs[addr_idx], round + 1, max_rounds);
            esp_lcd_panel_io_del(tp_io_handle);
        }

        /* Hard reset GT911 and wait progressively longer: 500, 750, 1000, 1250ms */
        int delay_ms = 500 + (round * 250);
        ESP_LOGW(TAG, "Resetting GT911, waiting %dms before retry...", delay_ms);
        gpio_set_level(BSP_LCD_TOUCH_RST, 0);
        vTaskDelay(pdMS_TO_TICKS(50));
        gpio_set_level(BSP_LCD_TOUCH_RST, 1);
        vTaskDelay(pdMS_TO_TICKS(delay_ms));
    }

